bit-finance/Reports/бит_УдалитьОСВПоЗаписямТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УдалитьОСВПоЗаписямТрансляции</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПриемника</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериодаПриемника</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаЗаполненияПолей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаЗаполненияПолейПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Reports/бит_УдалитьОСВПоЗаписямТрансляции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Процедура заполняет дополнительные списки.
// 
// Параметры:
//  СписокПараметровНаФорме     - СписокЗначений ИЛИ Неопределено - список параметров на форме.
//  СписокДополнительныхСвойств - СписокЗначений ИЛИ Неопределено - список дополнительных свойств.
// 
Процедура ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме, СписокДополнительныхСвойств) Экспорт
	
	// Список имен параметров СКД, заполняемых пользователем через элементы формы.
	СписокПараметровНаФорме.Добавить("Период"	  			 , "Период");
	СписокПараметровНаФорме.Добавить("ПериодПриемника"	  	 , "ПериодПриемника");	
	СписокПараметровНаФорме.Добавить("Организация"			 , "Организация");
		
	// Список дополнительных свойств.
	СписокДополнительныхСвойств.Добавить("ПравилаЗаполненияПолей");

КонецПроцедуры // ЗаполнитьДополнительныеСписки()

#КонецОбласти
 
#КонецЕсли
